---
kind: property
id: P:Autodesk.Revit.DB.BasicFileInfo.IsInProgress
source: html/d756cb3e-b7b6-b51a-1f0e-90c3cd862632.htm
---
# Autodesk.Revit.DB.BasicFileInfo.IsInProgress Property

Checks if the file is workshared and is in process of becoming Central.

## Syntax (C#)
```csharp
public bool IsInProgress { get; }
```